app/views/players/show.html.erb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."player_id" = ?  [["player_id", 1]]
---
			<ol>
				<% @player.playlists.each do |playlist| %>