app/controllers/playlists_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."player_id" = ? LIMIT 1  [["player_id", 2]]
---
  def index
    @playlists = Playlist.where(player_id: params[:player_id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @playlist.player = Player.find(params[:player_id])
    @playlist = Playlist.find(params[:id])

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", nil]]
---
  def set_playlist
    @playerid = params[:player_id]
    @playlist = Playlist.find(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @playerid = params[:player_id]
    @playlist = Playlist.new
    @playlist.player = Player.find(params[:player_id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @playerid = params[:player_id]
    @playlist = Playlist.find(params[:id])
    @playlist.player = Player.find(params[:player_id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "playlists" ("name", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "d"], ["player_id", 1], ["created_at", "2017-04-27 03:04:44.063214"], ["updated_at", "2017-04-27 03:04:44.063214"]]
---
  def create
    @playerid = params[:player_id]
    @playlist = Playlist.new(name: playlist_params[:name])
    @playlist.player = Player.find_by(id: params[:player_id])
    if @playlist.save

UPDATE "playlists" SET "name" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["name", "asdf"], ["updated_at", "2017-04-27 04:02:17.969033"], ["id", 10]]
---
  def update
    @playerid = params[:player_id]
    if @playlist.update(playlist_params)

DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]
---
  def destroy
    @playerid = params[:player_id]
    @playlist.destroy