app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = ?  [["playlist_id", 2]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
SELECT COUNT(*) FROM "songs" WHERE "songs"."playlist_id" = ?  [["playlist_id", 1]]
---
  def index
    @songs = Song.where(playlist_id: params[:playlist_id])
    @song_artist_name = @songs[0].artist_name unless @songs.empty?

SELECT "songs".* FROM "songs"
---
  def all
    @songs = Song.all

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 10]]
---
  def new
    @song = Song.new
    @song.playlist = Playlist.find(params[:playlist_id])

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "songs" ("name", "artist_name", "playlist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Baby"], ["artist_name", "Justin Bieber"], ["playlist_id", 1], ["created_at", "2017-04-27 05:26:20.385303"], ["updated_at", "2017-04-27 05:26:20.385303"]]
---
  def create
    @song = Song.new(name: song_params[:name], artist_name: song_params[:artist_name])
    @song.playlist = Playlist.find(params[:playlist_id])
    @song.playlist.player = Player.find(params[:player_id])
    if (@song.in_spotify? && !@song.playlist.songs.include?(@song))
      @song.playlist.songs.append(@song)
      @song.save