app/controllers/welcome_controller.rb

INSERT INTO "players" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "amandaklim@yahoo.com"], ["created_at", "2017-04-27 01:04:55.988129"], ["updated_at", "2017-04-27 01:04:55.988129"]]
SELECT  "players".* FROM "players" WHERE "players"."email" = ? LIMIT 1  [["email", "amandaklim@yahoo.com"]]
SELECT  1 AS one FROM "players" WHERE "players"."email" = ? LIMIT 1  [["email", "amandaklim@yahoo.com"]]
---
def spotify
  @spotify_user = RSpotify::User.new(request.env['omniauth.auth'])
  @tracks = @spotify_user.top_tracks(limit: 21, offset: 0, time_range: 'medium_term')
  @spotify_email = @spotify_user.email
  genre = @tracks[0].artists[0].genres[0]
  recommendations = RSpotify::Recommendations.generate(limit: 21, seed_tracks: [@tracks[0].id], seed_artists: [@tracks[1].artists[0].id], seed_genres: [@tracks[2].artists[0].genres[0]])
  @r_tracks = recommendations.tracks
  new_player = Player.new(email: @spotify_email)
  new_player.save unless Player.exists?(email: @spotify_email)